# Taps
tap "chipmk/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "mongodb/brew"
tap "oven-sh/bun"
tap "sidneys/homebrew"

# Binaries
brew "python@3.12"
brew "ansible"
brew "ansible-lint"
brew "docker"
brew "exiftool"
brew "fastfetch"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "helm"
brew "htop"
brew "hugo"
brew "libpq", link: true
brew "lsd"
brew "minikube"
brew "mongodb-atlas-cli"
brew "nvm"
brew "openssl@1.1"
brew "opentofu"
brew "starship"
brew "telnet"
brew "terraform"
brew "tmux"
brew "tree"
brew "wget"
brew "yarn"
brew "zoxide"
brew "zsh-autosuggestions"
brew "chipmk/tap/docker-mac-net-connect"
brew "oven-sh/bun/bun"

# Apps
cask "anki"
cask "beekeeper-studio"
cask "bespoke"
cask "canva"
cask "coteditor"
cask "datagrip"
cask "dictionaries"
cask "easydict"
cask "git-credential-manager"
cask "github"
cask "gitkraken"
cask "google-chrome"
cask "httpie"
cask "intellij-idea"
cask "iterm2"
cask "lens"
cask "miniconda"
cask "mongodb-compass"
cask "motrix"
cask "obsidian"
cask "openvpn-connect"
cask "pgadmin4"
cask "poe"
cask "postman"
cask "utm"
cask "whatsapp"
cask "zotero"

# Vscode extensions
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gitlab.gitlab-workflow"
vscode "gitpod.gitpod-desktop"
vscode "infeng.vscode-react-typescript"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "prisma.prisma"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "tim-koehler.helm-intellisense"
vscode "vscodevim.vim"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
